# Создать вручную и заполнить несколькими строками текстовый файл,
# в котором каждая строка должна содержать данные о фирме: название, форма собственности, выручка, издержки.
# Пример строки файла: firm_1 ООО 10000 5000.
#
# Необходимо построчно прочитать файл, вычислить прибыль каждой компании, а также среднюю прибыль.
# Если фирма получила убытки, в расчет средней прибыли ее не включать.
# Далее реализовать список. Он должен содержать словарь с фирмами и их прибылями,
# а также словарь со средней прибылью. Если фирма получила убытки,
# также добавить ее в словарь (со значением убытков).
# Пример списка: [{“firm_1”: 5000, “firm_2”: 3000, “firm_3”: 1000}, {“average_profit”: 2000}].
#
# Итоговый список сохранить в виде json-объекта в соответствующий файл.
# Пример json-объекта:
#
# [{"firm_1": 5000, "firm_2": 3000, "firm_3": 1000}, {"average_profit": 2000}]
#
# Подсказка: использовать менеджер контекста.

import json

statistics = {}
average = {}
json_data = [statistics, average]
with open("file07.txt", encoding="utf-8", mode="r") as f_obj:
    for line in f_obj.readlines():
        statistics[line.split()[0]] = int(line.split()[2]) - int(line.split()[3])
    average["average_profit"] = sum(statistics.values()) / 3

with open("file07.json", "w") as f_json:
    json.dump(json_data, f_json)

with open("file07.json", "r") as f_json:
    print(json.load(f_json))
